Revit 2027 API
DockablePaneProviderData Constructor
Initializes a new instance of the DockablePaneProviderData class
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePaneProviderData()
Public Sub New
public:
DockablePaneProviderData()
new : unit -> DockablePaneProviderData
See Also
Reference
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace